src/ResXManager.Translators/Service References/Microsoft.TerminologyService/Terminology1.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:i0="http://api.terminology.microsoft.com/terminology" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="Terminology" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:import namespace="http://api.terminology.microsoft.com/terminology" location="http://api.terminology.microsoft.com/Terminology.svc?wsdl=wsdl0" />
  <wsdl:types />
  <wsdl:binding name="BasicHttpBinding_Terminology" type="i0:Terminology">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="GetTranslations">
      <soap:operation soapAction="http://api.terminology.microsoft.com/terminology/Terminology/GetTranslations" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
      <wsdl:fault name="UnexpectedFault">
        <soap:fault use="literal" name="UnexpectedFault" namespace="" />
      </wsdl:fault>
      <wsdl:fault name="MissingParameterFault">
        <soap:fault use="literal" name="MissingParameterFault" namespace="" />
      </wsdl:fault>
      <wsdl:fault name="InvalidParametersFault">
        <soap:fault use="literal" name="InvalidParametersFault" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="GetLanguages">
      <soap:operation soapAction="http://api.terminology.microsoft.com/terminology/Terminology/GetLanguages" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
      <wsdl:fault name="UnexpectedFault">
        <soap:fault use="literal" name="UnexpectedFault" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="GetProducts">
      <soap:operation soapAction="http://api.terminology.microsoft.com/terminology/Terminology/GetProducts" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
      <wsdl:fault name="UnexpectedFault">
        <soap:fault use="literal" name="UnexpectedFault" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="GetCapability">
      <soap:operation soapAction="http://api.terminology.microsoft.com/terminology/Terminology/GetCapability" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="Terminology">
    <wsdl:port name="BasicHttpBinding_Terminology" binding="tns:BasicHttpBinding_Terminology">
      <soap:address location="http://api.terminology.microsoft.com/Terminology.svc" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>